### [1/1] build [bigw-terraform-azure-app-insights-web-tests - 20221106.1](https://dev.azure.com/bigw-azure-devops-poc//platform/_build/results?buildId=115716&view=results) Terraform produced the following plan: * test name: TestBigWAzAppInsightsAsAppInsightWebTestsDefault ```diff  Terraform will perform the following actions:  @@# module.app_insights.data.azurerm_key_vault.main[0] will be read during apply @@                                                            # (config refers to values not yet known)  <= data "azurerm_key_vault" "main"  { +     + access_policy                   = (known after apply)                                                                                +     + enable_rbac_authorization       = (known after apply)                                                                                +     + enabled_for_deployment          = (known after apply)                                                                                +     + enabled_for_disk_encryption     = (known after apply)                                                                                +     + enabled_for_template_deployment = (known after apply)                                                                                +     + id                              = (known after apply)                                                                                +     + location                        = (known after apply)                                                                                +     + name                            = "bigw-kv-dev-aae-terratst"                                                                         +     + network_acls                    = (known after apply)                                                                                +     + public_network_access_enabled   = (known after apply)                                                                                +     + purge_protection_enabled        = (known after apply)                                                                                +     + resource_group_name             = "bigw-rg-dev-aae-terratest-landing"                                                                +     + sku_name                        = (known after apply)                                                                                +     + tags                            = (known after apply)                                                                                +     + tenant_id                       = (known after apply)                                                                                +     + vault_uri                       = (known after apply)                                                                                 +     + timeouts {                                                                                                                           +         + read = (known after apply)                                                                                                       +       }                                                                                                                                        }  @@# module.app_insights.azurerm_application_insights.main["terratest-app-insights-Oe16ix"] will be created @@                                @@  + resource "azurerm_application_insights" "main" { @@                                                                                    +     + app_id                                = (known after apply)                                                                          +     + application_type                      = "web"                                                                                        +     + connection_string                     = (sensitive value)                                                                            +     + daily_data_cap_in_gb                  = (known after apply)                                                                          +     + daily_data_cap_notifications_disabled = (known after apply)                                                                          +     + disable_ip_masking                    = false                                                                                        +     + force_customer_storage_for_profiler   = false                                                                                        +     + id                                    = (known after apply)                                                                          +     + instrumentation_key                   = (sensitive value)                                                                            +     + internet_ingestion_enabled            = true                                                                                         +     + internet_query_enabled                = true                                                                                         +     + local_authentication_disabled         = false                                                                                        +     + location                              = "australiaeast"                                                                              +     + name                                  = "terratest-app-insights-Oe16ix"                                                              +     + resource_group_name                   = "terratest-rg-Oe16ix"                                                                        +     + retention_in_days                     = 30                                                                                           +     + sampling_percentage                   = 100                                                                                          +     + tags                                  = {                                                                                            +         + "Application" = "'tbc'"                                                                                                          +         + "CostCentre"  = "634"                                                                                                            +         + "Environment" = "'tbc'"                                                                                                          +         + "ManagedBy"   = "'tbc'"                                                                                                          +         + "Owner"       = "'tbc'"                                                                                                          +         + "Support"     = "'tbc'"                                                                                                          +       }                                                                                                                                        }  @@# module.app_insights.azurerm_key_vault_secret.app_id["terratest-app-insights-Oe16ix"] will be created @@                                  @@  + resource "azurerm_key_vault_secret" "app_id" { @@                                                                                      +     + id                      = (known after apply)                                                                                        +     + key_vault_id            = (known after apply)                                                                                        +     + name                    = "TERRATEST-APP-INSIGHTS-OE16IX--APP-ID"                                                                    +     + resource_id             = (known after apply)                                                                                        +     + resource_versionless_id = (known after apply)                                                                                        +     + value                   = (sensitive value)                                                                                          +     + version                 = (known after apply)                                                                                        +     + versionless_id          = (known after apply)                                                                                        +   }                                                                                                                                         @@# module.app_insights.azurerm_key_vault_secret.connection_string["terratest-app-insights-Oe16ix"] will be created @@                       @@  + resource "azurerm_key_vault_secret" "connection_string" { @@                                                                           +     + id                      = (known after apply)                                                                                        +     + key_vault_id            = (known after apply)                                                                                        +     + name                    = "TERRATEST-APP-INSIGHTS-OE16IX--CONNECTION-STRING"                                                         +     + resource_id             = (known after apply)                                                                                        +     + resource_versionless_id = (known after apply)                                                                                        +     + value                   = (sensitive value)                                                                                          +     + version                 = (known after apply)                                                                                        +     + versionless_id          = (known after apply)                                                                                        +   }                                                                                                                                         @@# module.app_insights.azurerm_key_vault_secret.instrumentation_key["terratest-app-insights-Oe16ix"] will be created @@                     @@  + resource "azurerm_key_vault_secret" "instrumentation_key" { @@                                                                         +     + id                      = (known after apply)                                                                                        +     + key_vault_id            = (known after apply)                                                                                        +     + name                    = "TERRATEST-APP-INSIGHTS-OE16IX--INSTRUMENTATION-KEY"                                                       +     + resource_id             = (known after apply)                                                                                        +     + resource_versionless_id = (known after apply)                                                                                        +     + value                   = (sensitive value)                                                                                          +     + version                 = (known after apply)                                                                                        +     + versionless_id          = (known after apply)                                                                                        +   }                                                                                                                                         @@# module.main.data.azurerm_application_insights.main["terratest-app-insights-Oe16ix"] will be read during apply @@                           # (config refers to values not yet known)  <= data "azurerm_application_insights" "main"  { +     + app_id              = (known after apply)                                                                                            +     + application_type    = (known after apply)                                                                                            +     + connection_string   = (sensitive value)                                                                                              +     + id                  = (known after apply)                                                                                            +     + instrumentation_key = (known after apply)                                                                                            +     + location            = (known after apply)                                                                                            +     + name                = "terratest-app-insights-Oe16ix"                                                                                +     + resource_group_name = "terratest-rg-Oe16ix"                                                                                          +     + retention_in_days   = (known after apply)                                                                                            +     + tags                = (known after apply)                                                                                            +     + workspace_id        = (known after apply)                                                                                             +     + timeouts {                                                                                                                           +         + read = (known after apply)                                                                                                       +       }                                                                                                                                        }  @@# module.main.azurerm_application_insights_web_test.main["terratest-app-insights-Oe16ix--[200] - uptime-test-1-Oe16ix"] will be created @@ @@  + resource "azurerm_application_insights_web_test" "main" { @@                                                                           +     + application_insights_id = (known after apply)                                                                                        +     + configuration           = (known after apply)                                                                                        +     + enabled                 = true                                                                                                       +     + frequency               = 300                                                                                                        +     + geo_locations           = [                                                                                                          +         + "emea-au-syd-edge",                                                                                                              +         + "apac-hk-hkn-azr",                                                                                                               +         + "apac-jp-kaw-edge",                                                                                                              +       ]                                                                                                                                    +     + id                      = (known after apply)                                                                                        +     + kind                    = "ping"                                                                                                     +     + location                = "australiaeast"                                                                                            +     + name                    = "[200] - uptime-test-1-Oe16ix"                                                                             +     + resource_group_name     = "terratest-rg-Oe16ix"                                                                                      +     + retry_enabled           = true                                                                                                       +     + synthetic_monitor_id    = (known after apply)                                                                                        +     + tags                    = {                                                                                                          +         + "Application" = "'tbc'"                                                                                                          +         + "CostCentre"  = "634"                                                                                                            +         + "Environment" = "'tbc'"                                                                                                          +         + "ManagedBy"   = "'tbc'"                                                                                                          +         + "Owner"       = "'tbc'"                                                                                                          +         + "Support"     = "'tbc'"                                                                                                          +       }                                                                                                                                    +     + timeout                 = 60                                                                                                         +   }                                                                                                                                         @@# module.main.azurerm_application_insights_web_test.main["terratest-app-insights-Oe16ix--[301] - uptime-test-3-Oe16ix"] will be created @@ @@  + resource "azurerm_application_insights_web_test" "main" { @@                                                                           +     + application_insights_id = (known after apply)                                                                                        +     + configuration           = (known after apply)                                                                                        +     + enabled                 = true                                                                                                       +     + frequency               = 300                                                                                                        +     + geo_locations           = [                                                                                                          +         + "emea-au-syd-edge",                                                                                                              +         + "apac-hk-hkn-azr",                                                                                                               +         + "apac-jp-kaw-edge",                                                                                                              +       ]                                                                                                                                    +     + id                      = (known after apply)                                                                                        +     + kind                    = "ping"                                                                                                     +     + location                = "australiaeast"                                                                                            +     + name                    = "[301] - uptime-test-3-Oe16ix"                                                                             +     + resource_group_name     = "terratest-rg-Oe16ix"                                                                                      +     + retry_enabled           = true                                                                                                       +     + synthetic_monitor_id    = (known after apply)                                                                                        +     + tags                    = {                                                                                                          +         + "Application" = "'tbc'"                                                                                                          +         + "CostCentre"  = "634"                                                                                                            +         + "Environment" = "'tbc'"                                                                                                          +         + "ManagedBy"   = "'tbc'"                                                                                                          +         + "Owner"       = "'tbc'"                                                                                                          +         + "Support"     = "'tbc'"                                                                                                          +       }                                                                                                                                    +     + timeout                 = 60                                                                                                         +   }                                                                                                                                         @@# module.main.azurerm_application_insights_web_test.main["terratest-app-insights-Oe16ix--[404] - uptime-test-2-Oe16ix"] will be created @@ @@  + resource "azurerm_application_insights_web_test" "main" { @@                                                                           +     + application_insights_id = (known after apply)                                                                                        +     + configuration           = (known after apply)                                                                                        +     + enabled                 = true                                                                                                       +     + frequency               = 300                                                                                                        +     + geo_locations           = [                                                                                                          +         + "emea-au-syd-edge",                                                                                                              +         + "apac-hk-hkn-azr",                                                                                                               +         + "apac-jp-kaw-edge",                                                                                                              +       ]                                                                                                                                    +     + id                      = (known after apply)                                                                                        +     + kind                    = "ping"                                                                                                     +     + location                = "australiaeast"                                                                                            +     + name                    = "[404] - uptime-test-2-Oe16ix"                                                                             +     + resource_group_name     = "terratest-rg-Oe16ix"                                                                                      +     + retry_enabled           = true                                                                                                       +     + synthetic_monitor_id    = (known after apply)                                                                                        +     + tags                    = {                                                                                                          +         + "Application" = "'tbc'"                                                                                                          +         + "CostCentre"  = "634"                                                                                                            +         + "Environment" = "'tbc'"                                                                                                          +         + "ManagedBy"   = "'tbc'"                                                                                                          +         + "Owner"       = "'tbc'"                                                                                                          +         + "Support"     = "'tbc'"                                                                                                          +       }                                                                                                                                    +     + timeout                 = 60                                                                                                         +   }                                                                                                                                         @@# module.main.random_uuid.main["terratest-app-insights-Oe16ix--[200] - uptime-test-1-Oe16ix"] will be created @@                           @@  + resource "random_uuid" "main" { @@                                                                                                     +     + id      = (known after apply)                                                                                                        +     + keepers = {                                                                                                                          +         + "application_insights_name" = "terratest-app-insights-Oe16ix"                                                                    +         + "name"                      = "[200] - uptime-test-1-Oe16ix"                                                                     +       }                                                                                                                                    +     + result  = (known after apply)                                                                                                        +   }                                                                                                                                         @@# module.main.random_uuid.main["terratest-app-insights-Oe16ix--[301] - uptime-test-3-Oe16ix"] will be created @@                           @@  + resource "random_uuid" "main" { @@                                                                                                     +     + id      = (known after apply)                                                                                                        +     + keepers = {                                                                                                                          +         + "application_insights_name" = "terratest-app-insights-Oe16ix"                                                                    +         + "name"                      = "[301] - uptime-test-3-Oe16ix"                                                                     +       }                                                                                                                                    +     + result  = (known after apply)                                                                                                        +   }                                                                                                                                         @@# module.main.random_uuid.main["terratest-app-insights-Oe16ix--[404] - uptime-test-2-Oe16ix"] will be created @@                           @@  + resource "random_uuid" "main" { @@                                                                                                     +     + id      = (known after apply)                                                                                                        +     + keepers = {                                                                                                                          +         + "application_insights_name" = "terratest-app-insights-Oe16ix"                                                                    +         + "name"                      = "[404] - uptime-test-2-Oe16ix"                                                                     +       }                                                                                                                                    +     + result  = (known after apply)                                                                                                        +   }                                                                                                                                         @@# module.rg.azurerm_resource_group.main will be created @@                                                                                 @@  + resource "azurerm_resource_group" "main" { @@                                                                                          +     + id       = (known after apply)                                                                                                       +     + location = "australiaeast"                                                                                                           +     + name     = "terratest-rg-Oe16ix"                                                                                                     +     + tags     = {                                                                                                                         +         + "Application" = "'tbc'"                                                                                                          +         + "CostCentre"  = "634"                                                                                                            +         + "Environment" = "'tbc'"                                                                                                          +         + "ManagedBy"   = "'tbc'"                                                                                                          +         + "Owner"       = "'tbc'"                                                                                                          +         + "Support"     = "'tbc'"                                                                                                          +       }                                                                                                                                        }  Plan: 11 to add, 0 to change, 0 to destroy. ```